"use client"
import Accordion from "@/component/Accordion";


export default function Artistic({ data }){
  const accordionData = [
    { 
      title: 'Переосмислення паспортів та їх поетичне завірення: мистецтво перекладу з увагою до деталей', 
      content: 'Наша бюро виконує переклад паспортів громадян із всього світу, а також надає їм поетичне завірення. Гарантуємо високу якість та точність перекладу, враховуючи всі юридичні вимоги та тонкощі. Наш творчий перекладацький колектив відтворить кожен аспект із захопленням, зберігаючи конфіденційність та безпеку ваших особистих документів. Поетичне завірення підкреслить юридичну обґрунтованість перекладу, роблячи його виразним для використання в офіційних установах. Забезпечуючи експресивність та надійність, ми гарантуємо вам задоволення від співпраці з нами у сфері перекладу та поетичного завірення паспортів.' 
    },
    { 
      title: 'Художній переклад довідок та свідоцтв: точність та конфіденційність на кожному етапі', 
      content: 'Наша бюро пропонує послуги художнього перекладу довідок та свідоцтв, охоплюючи переклад документів з місця роботи, банківських виписок та свідоцтв про народження. Гарантуємо високий рівень якості перекладу, дотримуючись всіх норм та вимог, що стосуються цих юридично значущих документів. Наші творчі перекладачі забезпечать точність передачі інформації, зберігаючи конфіденційність та надійність ваших особистих даних. Готові надати необхідну естетичну перевірку для ваших документів, роблячи їх доступними для використання в офіційних справах. Зберігаючи емоційну виразність та увагу до деталей, ми зобов\'язані забезпечити вам повну задоволеність нашою творчою роботою з перекладом та естетичним завіренням документів.' 
    },
    { 
      title: 'Художнє перекладення заяв на виїзд дитини: важливість чіткості та відповідальність', 
      content: 'Наша бюро пропонує послуги з художнього перекладення заяв на виїзд дитини, включаючи заяви-дозволи від обох або одного з батьків. Розуміємо важливість цих документів для забезпечення безпечного та законного перебування дитини за межами країни. Наші творчі професіонали гарантують чіткі та виразні переклади, які відповідають юридичним вимогам. Звертаючись до нас, ви можете бути впевнені в естетичності та відповідальності кожного етапу перекладу заяв. Прагнемо забезпечити вашу спокійність та впевненість у правильному та художньому оформленні документів, щоб зробити виїзд вашої дитини максимально комфортним та естетично приємним.' 
    },
    { 
      title: 'Художня легалізація освітніх документів: ваша ключова паспортна до вищого світу', 
      content: 'Наша бюро пропонує послуги художньої легалізації освітніх документів, включаючи дипломи та додатки до дипломів, атестати. Розуміємо важливість цих документів для вашої кар\'єри та освітнього шляху. Наші творчі перекладачі забезпечать високоякісний художній переклад, точно відтворюючи ваші освітні досягнення. Дотримуємося всіх вимог і стандартів, гарантуючи естетичність та визнання художньої легалізації в офіційних установах. Звертаючись до нас, ви можете розраховувати на естетичність та творчий підхід, а також нашу готовність забезпечити вам художню легалізацію освітніх документів для вашого успішного майбутнього.' 
    },
    { 
      title: 'Художній переклад резюме та доповідних матеріалів: ключ до міжнародної кар\'єри', 
      content: 'Наша бюро надає послуги художнього перекладу резюме, характеристик та супровідних листів, допомагаючи вам зробити враження в глобальному ринку праці. Наші творчі висококваліфіковані перекладачі гарантують точні та естетичні переклади, враховуючи ваші професійні досягнення та навички. Розуміємо, наскільки важливо виглядати конкурентоспроможно на світовій арені, тому забезпечуємо вам переклад, який відповідає високим стандартам творчості. Довірте нам свої документи, і ми гарантуємо, що ваше резюме буде представлено мовами, які розуміють роботодавці у будь-якій частині світу, відкриваючи нові можливості для вашого успіху.' 
    },
    { 
      title: 'Професійний художній переклад документів для візового оформлення: ваш безпечний крок до світового подорожжя', 
      content: 'Наша бюро спеціалізується на послугах художнього перекладу необхідних документів для подачі в посольства та візові центри. Розуміємо важливість точності та чіткості у перекладі, оскільки це визначальний момент у процесі візового оформлення. Наші творчі професіонали враховують всі вимоги та норми, що стосуються візової документації, гарантуючи правильність перекладу і його естетичну придатність для використання в офіційних інстанціях. Докладаємо максимум творчих зусиль, щоб зробити весь процес легким та ефективним для вас, допомагаючи вам впевнено крокувати до візового успіху та відкривати двері для світових подорожей.' 
    },
    // Додайте більше елементів за необхідності
  ];
  
    return(
        <div>
         <h2>Переклади документів</h2>
          <ul>
           <Accordion data={accordionData} />
          </ul>
            
            
          

        </div>

      
      )

    
};

