"use client"
import Accordion from "@/component/Accordion";


export default function Notarial({ data }){
  const accordionData = [
    { 
      title: 'Нотаріальний переклад документів: законність та гарантія точності', 
      content: 'Надаємо послуги нотаріального перекладу документів, забезпечуючи їх законність та визнання у будь-якому юрисдикційному середовищі. Наші кваліфіковані перекладачі та нотаріуси гарантують точність та вірність перекладу, а нотаріальне засвідчення підкреслить його юридичну обґрунтованість. Звертайтеся до нас для отримання професійної та відповідальної підтримки у нотаріальному перекладі ваших документів.' 
    },
    { 
      title: 'Нотаріальне засвідчення перекладу: підтвердження юридичної сили', 
      content: 'Ми гарантуємо нотаріальне засвідчення кожного перекладу, зробленого нашою командою професіоналів. Це забезпечить вашій документації визнання та придатність для використання в офіційних установах, судових процедурах та інших юридично значущих випадках. Ми прагнемо забезпечити вам максимальну впевненість у правомірності та ефективності нотаріального перекладу.' 
    },
    { 
      title: 'Експрес-нотаріальний переклад: швидкість та надійність у кожному випадку', 
      content: 'Наша команда готова надати вам експрес-нотаріальний переклад, забезпечуючи швидкість та високу якість виконання. Ми розуміємо, наскільки важливо отримати правомірний та точний переклад у короткі терміни. Звертайтеся до нас, і ми гарантуємо надійність та оперативність у кожному вашому нотаріальному перекладі.' 
    },
    // Додайте більше елементів за необхідності
  ];
  
    return(
        <div>
         <h2>Переклади документів</h2>
          <ul>
           <Accordion data={accordionData} />
          </ul>
            
            
          

        </div>

      
      )

    
};

