"use client"
import Accordion from "@/component/Accordion";


export default function Consular({ data }){
  const accordionData = [
    { 
      title: 'Консульська легалізація: офіційна визначеність та визнання у будь-якій країні', 
      content: 'Надаємо послуги консульської легалізації для вашої документації, забезпечуючи офіційність та визнання у будь-якій країні світу. Наші експерти в справах легалізації забезпечать правильність та відповідність процедур в кожному консульстві. Ми розуміємо важливість швидкості та точності у такому процесі, тому гарантуємо вам ефективність та повну підтримку на кожному етапі консульської легалізації.' 
    },
    { 
      title: 'Апостиль та консульська легалізація документів: впевненість у їхній правомірності', 
      content: 'Ми забезпечимо як апостиль, так і консульську легалізацію вашої документації, роблячи їх придатними для використання в будь-якій країні світу. Наша команда фахівців у сфері міжнародного права та легалізації гарантує вам повну відповідність всім вимогам та стандартам. Звертайтеся до нас для забезпечення легальності та визнання ваших документів на міжнародному рівні.' 
    },
    { 
      title: 'Консультації з консульської легалізації: професійна підтримка у кожному випадку', 
      content: 'Наші консультанти готові надати вам всю необхідну інформацію та підтримку з питань консульської легалізації. Ми розкажемо вам про всі етапи та вимоги процедури, а також надамо рекомендації з оптимізації та прискорення процесу. З нами ви отримаєте якісну та професійну допомогу в оформленні консульської легалізації вашої документації.' 
    },
    // Додайте більше елементів за необхідності
  ];
  
    return(
        <div>
         <h2>Переклади документів</h2>
          <ul>
           <Accordion data={accordionData} />
          </ul>
            
            
          

        </div>

      
      )

    
};

