"use client"
import Accordion from "@/component/Accordion";


export default function Apostile({ data }){
  const accordionData = [
    { 
      title: 'Апостиль паспортів та їх нотаріальне засвідчення: високоякісні послуги з уважністю до деталей', 
      content: 'Наша компанія надає послуги з апостилю паспортів громадян усіх країн світу, а також нотаріального засвідчення цих апостилів. Ми гарантуємо високу якість та точність апостилювання, дотримуючись всіх юридичних норм та вимог. Наш досвідчений персонал забезпечить точність передачі всіх даних, зберігаючи конфіденційність та безпеку ваших особистих документів. Нотаріальне засвідчення підкреслить юридичну обґрунтованість апостилювання, зробляючи його придатним для використання в офіційних установах. Забезпечуючи швидкість та надійність, ми гарантуємо ваше задоволення співпрацею з нами в сфері апостилювання та нотаріального засвідчення паспортів.' 
    },
    { 
      title: 'Апостиль довідок та свідоцтв: точність та конфіденційність на кожному етапі', 
      content: 'Наша компанія пропонує послуги з апостилювання довідок та свідоцтв, охоплюючи апостилювання документів з місця роботи, банківських виписок та свідоцтв про народження. Ми гарантуємо високий рівень якості апостилювання, дотримуючись всіх норм та вимог, що стосуються цих юридично значущих документів. Наші досвідчені спеціалісти забезпечать точність передачі інформації, зберігаючи конфіденційність та надійність ваших особистих даних. Ми готові надати необхідну перевірку для ваших документів, роблячи їх доступними для використання в офіційних справах. Оберігаючи швидкість та дбайливість на кожному етапі, ми зобов\'язані забезпечити вам повну задоволеність нашою ефективною роботою з апостилювання та завіренням документів.' 
    },
    { 
      title: 'Апостиль заяв на виїзд дитини: важливість чіткості та відповідальність', 
      content: 'Наша компанія пропонує послуги з апостилювання заяв на виїзд дитини, включаючи апостилювання заяв-дозволів від обох або одного з батьків. Ми розуміємо важливість цих документів для забезпечення безпечного та законного перебування дитини за межами країни. Наші професіонали в галузі апостилювання гарантують чіткі та точні апостилювання, які відповідають юридичним вимогам. Звертаючись до нас, ви можете бути впевнені в конфіденційності та надійності кожного етапу апостилювання заяв. Ми прагнемо забезпечити вашу спокійність та впевненість у правильному та швидкому оформленні документів, щоб зробити виїзд вашої дитини максимально комфортним та безпечним.' 
    },
    { 
      title: 'Професійний апостиль освітніх документів: ваша ключова паспортна до вищого світу', 
      content: 'Наша компанія пропонує послуги з апостилювання освітніх документів, включаючи дипломи та додатки до дипломів, атестати. Ми розуміємо важливість цих документів для вашої кар\'єри та освітнього шляху. Наші досвідчені спеціалісти забезпечать високоякісне апостиль, точно відтворюючи ваші освітні досягнення. Ми дотримуємося всіх вимог і стандартів, гарантуючи легальність та визнання апостилю в офіційних установах. Звертаючись до нас, ви можете розраховувати на швидкість та надійність, а також нашу готовність забезпечити вам високоякісний апостиль освітніх документів для вашого успішного майбутнього.' 
    },
    { 
      title: 'Апостиль резюме та доповідних матеріалів: ключ до міжнародної кар\'єри', 
      content: 'Наша компанія надає послуги з апостилювання резюме, характеристик та супровідних листів, допомагаючи вам зробити враження в глобальному ринку праці. Наші висококваліфіковані спеціалісти гарантують точні та ефективні апостилювання, враховуючи ваші професійні досягнення та навички. Ми розуміємо, наскільки важливо виглядати конкурентоспроможно на світовій арені, тому забезпечуємо вам апостиль, який відповідає високим стандартам професійності. Довірте нам свої документи, і ми гарантуємо, що ваше резюме буде представлено мовами, які розуміють роботодавці у будь-якій частині світу, відкриваючи нові можливості для вашого успіху.' 
    },
    { 
      title: 'Професійний апостиль документів для візового оформлення: ваш безпечний крок до світового подорожжя', 
      content: 'Наша компанія спеціалізується на послугах з апостилювання необхідних документів для подачі в посольства та візові центри. Ми розуміємо важливість точності та чіткості у апостильованому перекладі, оскільки це визначальний момент у процесі візового оформлення. Наші досвідчені спеціалісти враховують всі вимоги та норми, що стосуються візової документації, гарантуючи правильність апостилювання і його придатність для використання в офіційних інстанціях. Ми докладаємо максимум зусиль, щоб зробити весь процес легким та ефективним для вас, допомагаючи вам впевнено крокувати до візового успіху.'}
  ];
  
  
    return(
        <div>
         <h2>Переклади документів</h2>
          <ul>
           <Accordion data={accordionData} />
          </ul>
            
            
          

        </div>

      
      )

    
};

