"use client"
import Accordion from "@/component/Accordion";


export default function Legalization({ data }){
  const accordionData = [
    
      { 
        title: 'Легалізація паспортів та їх нотаріальне засвідчення: високоякісні послуги з уважністю до деталей', 
        content: 'Наша компанія надає послуги з легалізації паспортів громадян усіх країн світу, а також нотаріального засвідчення цих легалізацій. Ми гарантуємо високу якість та точність легалізації, дотримуючись всіх юридичних норм та вимог. Наш досвідчений персонал забезпечить точність передачі всіх даних, зберігаючи конфіденційність та безпеку ваших особистих документів. Нотаріальне засвідчення підкреслить юридичну обґрунтованість легалізації, зробляючи її придатною для використання в офіційних установах. Забезпечуючи швидкість та надійність, ми гарантуємо ваше задоволення співпрацею з нами в сфері легалізації та нотаріального засвідчення паспортів.' 
      },
      { 
        title: 'Легалізація довідок та свідоцтв: точність та конфіденційність на кожному етапі', 
        content: 'Наша компанія пропонує послуги з легалізації довідок та свідоцтв, охоплюючи легалізацію документів з місця роботи, банківських виписок та свідоцтв про народження. Ми гарантуємо високий рівень якості легалізації, дотримуючись всіх норм та вимог, що стосуються цих юридично значущих документів. Наші досвідчені спеціалісти забезпечать точність передачі інформації, зберігаючи конфіденційність та надійність ваших особистих даних. Ми готові надати необхідну перевірку для ваших документів, роблячи їх доступними для використання в офіційних справах. Оберігаючи швидкість та дбайливість на кожному етапі, ми зобов\'язані забезпечити вам повну задоволеність нашою ефективною роботою з легалізацією та завіренням документів.' 
      },
      { 
        title: 'Легалізація заяв на виїзд дитини: важливість чіткості та відповідальність', 
        content: 'Наша компанія пропонує послуги з легалізації заяв на виїзд дитини, включаючи легалізацію заяв-дозволів від обох або одного з батьків. Ми розуміємо важливість цих документів для забезпечення безпечного та законного перебування дитини за межами країни. Наші професіонали в галузі легалізації гарантують чіткі та точні легалізації, які відповідають юридичним вимогам. Звертаючись до нас, ви можете бути впевнені в конфіденційності та надійності кожного етапу легалізації заяв. Ми прагнемо забезпечити вашу спокійність та впевненість у правильному та швидкому оформленні документів, щоб зробити виїзд вашої дитини максимально комфортним та безпечним.' 
      },
      { 
        title: 'Професійна легалізація освітніх документів: ваша ключова паспортна до вищого світу', 
        content: 'Наша компанія пропонує послуги з легалізації освітніх документів, включаючи дипломи та додатки до дипломів, атестати. Ми розуміємо важливість цих документів для вашої кар\'єри та освітнього шляху. Наші досвідчені спеціалісти забезпечать високоякісний легалізацію, точно відтворюючи ваші освітні досягнення. Ми дотримуємося всіх вимог і стандартів, гарантуючи легальність та визнання легалізації в офіційних установах. Звертаючись до нас, ви можете розраховувати на швидкість та надійність, а також нашу готовність забезпечити вам високоякісний легалізацію освітніх документів для вашого успішного майбутнього.' 
      },
      { 
        title: 'Легалізація резюме та доповідних матеріалів: ключ до міжнародної кар\'єри', 
        content: 'Наша компанія надає послуги з легалізації резюме, характеристик та супровідних листів, допомагаючи вам зробити враження в глобальному ринку праці. Наші висококваліфіковані спеціалісти гарантують точні та ефективні легалізації, враховуючи ваші професійні досягнення та навички. Ми розуміємо, наскільки важливо виглядати конкурентоспроможно на світовій арені, тому забезпечуємо вам легалізацію, яка відповідає високим стандартам професійності. Довірте нам свої документи, і ми гарантуємо, що ваше резюме буде представлено мовами, які розуміють роботодавці у будь-якій частині світу, відкриваючи нові можливості для вашого успіху.' 
      },
      { 
        title: 'Професійна легалізація документів для візового оформлення: ваш безпечний крок до світового подорожжя', 
        content: 'Наша компанія спеціалізується на послугах з легалізації необхідних документів для подачі в посольства та візові центри. Ми розуміємо важливість точності та чіткості у легалізованому перекладі, оскільки це визначальний момент у процесі візового оформлення. Наші досвідчені спеціалісти враховують всі вимоги та норми, що стосуються візової документації, гарантуючи правильність легалізації і його придатність для використання в офіційних інстанціях. Ми докладаємо максимум зусиль, щоб зробити весь процес легким та ефективним для вас, допомагаючи вам впевнено крокувати до візового успіху та відкривати двері для світових подорожей.' 
      },
      // Додайте більше елементів за необхідності
    ];
  
    return(
        <div>
         <h2>Переклади документів</h2>
          <ul>
           <Accordion data={accordionData} />
          </ul>
            
            
          

        </div>

      
      )

    
};

