const reviews = [
    {
      id: 1,
      name: 'Олена Коваль',
      job: 'Менеджер з продажу',
      image:
        '/customer1.png',
      text:
        "Дякую за чудовий сервіс! Переклади були виконані швидко та професійно. Зараз можу спокійно користуватися документами у будь-якій країні. Рекомендую ваші послуги!",
    },
    {
      id: 2,
      name: 'Ігор Петренко',
      job: 'Юрист',
      image:
        '/customer3.png',
      text:
        'Професійний підхід та висока якість перекладів. Важливо мати надійного партнера у справах документації. Дякую за співпрацю, буду рекомендувати ваше агентство колегам!',
    },
    {
      id: 3,
      name: 'Марія Литвиненко',
      job: 'Медсестра',
      image:
        '/customer2.png',
      text:
        'Дуже вдячна за швидкий та точний переклад моїх медичних документів. Тепер можу зручно подавати їх при подорожах та отриманні міжнародних страховок. Ваш сервіс - невід\'ємна частина мого життя!',
    },
    {
      id: 4,
      name: 'Наталія Шевченко',
      job: 'Викладач',
      image:
        '/customer4.png',
      text:
        'Вражена вашою командою та якістю послуг. Переклад дипломів та наукових статей був виконаний на високому рівні. Рекомендую ваше агентство своїм студентам та колегам! ',
    },
  ];
  
  export default reviews;