import '@/styles/component.benefits.scss'
import Button from '@/component/button'

export default function OurBenefits(props) {
    return(
        <div className='benefits-wrapper'>

           <div className='bodyBenefits'>
           <div>
                <h2>Наші переваги</h2>
                <p>Бюро перекладів мають низку переваг, серед яких професіоналізм, знання мов, 
                    спеціалізація в різних галузях, комплексне обслуговування, економія часу та коштів, 
                    гнучкість в умовах оплати та ціноутворенні, конфіденційність, зручність та додаткові послуги, 
                    такі як організація заходів та розробка глосаріїв.</p>
                <Button text='Послуги' href="/services" />
            </div>

            <div>
                <h3>Ось деякі переваги бюро перекладів:</h3>
                <ul>
                    <li>Професіоналізм: У бюро перекладів працюють професійні перекладачі,
                         які мають досвід у різних галузях і можуть забезпечити точний і якісний переклад.</li>
                    <li>Знання мов: Перекладачі в бюро володіють кількома мовами,
                         що дозволяє їм виконувати широкий спектр перекладацьких проектів</li>
                    <li>Індивідуальний підхід: Бюро перекладів часто пропонують персоналізовані послуги,
                         пристосовуючи свій підхід до задоволення конкретних потреб кожного клієнта</li>
                    <li>Пунктуальність: Бюро розуміють важливість дотримання дедлайнів і прагнуть
                         виконати переклад вчасно</li>
                </ul>
            </div>
           </div>
        </div>
    )
}