"use client"
import Accordion from "@/component/Accordion";


export default function Financial({ data }){
  const accordionData = [
    { 
      title: 'Фінансовий переклад документів: точність та конфіденційність', 
      content: 'Забезпечте точний та конфіденційний переклад фінансових документів, довіривши це нашим професіоналам. Ми гарантуємо високу якість перекладу бухгалтерських звітів, фінансових заяв та інших фінансових документів, дотримуючись всіх стандартів та вимог, що стосуються цієї специфічної сфери.' 
    },
    { 
      title: 'Переклад договорів та угод: збереження сенсу та юридичної чистоти', 
      content: 'Маючи великий досвід у перекладі фінансових угод та договорів, ми гарантуємо збереження сенсу, структури та юридичної чистоти усіх нюансів документів. Наші перекладачі розуміють фінансову термінологію та забезпечать вам переклад, який відповідає вимогам та стандартам цієї галузі.' 
    },
    { 
      title: 'Фінансовий переклад для інвестицій: зрозумілість та прозорість', 
      content: 'Надаємо фінансовий переклад документів для інвестицій, забезпечуючи зрозумілість та прозорість усіх фінансових аспектів. Ми готові забезпечити переклад інвестиційних звітів, аналізів ринків та інших документів для успішної взаємодії з фінансовими партнерами.' 
    },
    // Додайте більше елементів за необхідності
  ];
  
    return(
        <div>
         <h2>Переклади документів</h2>
          <ul>
           <Accordion data={accordionData} />
          </ul>
            
            
          

        </div>

      
      )

    
};

