"use client"
import Accordion from "@/component/Accordion";


export default function Medical({ data }){
  const accordionData = [
    { 
      title: 'Медичний переклад документів: точність та конфіденційність', 
      content: 'Надаємо професійні послуги з медичного перекладу документів, забезпечуючи точність та конфіденційність в обробці чутливої медичної інформації. Наші досвідчені медичні перекладачі забезпечать вірний та легальний переклад медичних звітів, історій хвороб, рецептів та інших документів, необхідних для медичного використання.' 
    },
    { 
      title: 'Медичний переклад для міжнародних пацієнтів: легкість спілкування та розуміння', 
      content: 'Ми допомагаємо міжнародним пацієнтам отримувати доступ до якісних медичних послуг, забезпечуючи переклад медичної документації на їхній рідний мові. Це допомагає пацієнтам краще розуміти своє становище, процедури та рекомендації лікарів, забезпечуючи ефективніше лікування та спілкування.' 
    },
    { 
      title: 'Медичний переклад для клінічних досліджень: важливість точності та стандартів', 
      content: 'Надаємо послуги медичного перекладу для клінічних досліджень, дотримуючись високих стандартів точності та легальності. Наша команда забезпечить вам професійний переклад протоколів, пацієнтських інформаційних листів, звітів та інших документів, що стосуються клінічних випробувань.' 
    },
    // Додайте більше елементів за необхідності
  ];
  
    return(
        <div>
         <h2>Переклади документів</h2>
          <ul>
           <Accordion data={accordionData} />
          </ul>
            
            
          

        </div>

      
      )

    
};

