"use client"
import Accordion from "@/component/Accordion";


export default function Legal({ data }){
  const accordionData = [
    { 
      title: 'Юридичний переклад документів: надійність та професіоналізм', 
      content: 'Надаємо компетентні послуги з юридичного перекладу документів, забезпечуючи високий ступінь надійності та професіоналізму. Наша команда кваліфікованих перекладачів з розумінням правових термінів та контексту гарантує точний переклад усіх юридично значущих документів, забезпечуючи їхню придатність до використання в судових та юридичних процедурах.' 
    },
    { 
      title: 'Нотаріальний переклад: легальність та визнання', 
      content: 'Надаємо нотаріальний переклад документів, що підкреслює їхню легальність та визнання в офіційних установах. Нотаріальне засвідчення перекладів гарантує їх правову обгрунтованість та можливість використання в різних правових справах, забезпечуючи вам повну впевненість у юридичній чистоті документів.' 
    },
    { 
      title: 'Юридичний переклад для бізнесу: забезпечення точності та відповідності', 
      content: 'Надаємо юридичний переклад документів для бізнесу, забезпечуючи точність та відповідність усіх правових аспектів діяльності компанії. Наші перекладачі з розумінням корпоративного права та договірних зобов\'язань забезпечать вам професійний переклад угод, статутів, юридичних висновків та інших документів для успішної бізнес-діяльності.' 
    },
    // Додайте більше елементів за необхідності
  ];
  
    return(
        <div>
         <h2>Переклади документів</h2>
          <ul>
           <Accordion data={accordionData} />
          </ul>
            
            
          

        </div>

      
      )

    
};

