"use client"
import Accordion from "@/component/Accordion";


export default function Webtranslate({ data }){
  const accordionData = [
    { 
      title: 'Переклад веб-сайту: створення мосту між культурами та мовами', 
      content: 'Наша команда забезпечить повний переклад вашого веб-сайту, створюючи ефективний міст між різними культурами та мовами. Ми розуміємо важливість точності та стилю в перекладі веб-контенту для привертання міжнародної аудиторії. Незалежно від розміру вашого сайту, ми гарантуємо, що кожна сторінка буде перекладена з врахуванням контексту та намірів, щоб забезпечити зручність та зрозумілість для всіх користувачів. Наші досвідчені лінгвісти та технічні експерти забезпечать, щоб ваш веб-сайт виглядав професійно та привабливо у будь-якій мові, відкриваючи нові можливості для розвитку вашого бізнесу.' 
    },
    { 
      title: 'Адаптація користувацького інтерфейсу: забезпечте комфорт своїм користувачам', 
      content: 'Наша команда проведе адаптацію користувацького інтерфейсу вашого веб-сайту, щоб забезпечити комфорт та легкість використання для користувачів будь-якої мови. Ми не лише перекладемо тексти, але і врахуємо локалізацію елементів дизайну та функціоналу. Це допоможе створити приємний та зрозумілий інтерфейс для користувачів з різних культур, підвищуючи задоволення від використання вашого веб-сайту. Наші фахівці з UX/UI гарантують, що ваш сайт залишить враження не лише завдяки високоякісному контенту, але і завдяки зручності його використання.' 
    },
    { 
      title: 'Оптимізація для пошукових систем у кожній мові: просування на міжнародному рівні', 
      content: 'Ми здійснимо повний переклад ключових слів та контенту для оптимізації вашого веб-сайту для пошукових систем у кожній мові. Гарантуємо, що ваш сайт буде здатний конкурувати на міжнародному рівні, привертаючи нових відвідувачів з різних частин світу. Застосовуючи стратегії міжнародного SEO, ми забезпечимо оптимальну видимість вашого веб-сайту для різних аудиторій. Наш підхід до міжнародної оптимізації дозволить вам розширити свій вплив та зайняти важливі позиції в пошукових результатах.' 
    },
    // Додайте більше елементів за необхідності
  ];
  
    return(
        <div>
         <h2>Переклади документів</h2>
          <ul>
           <Accordion data={accordionData} />
          </ul>
            
            
          

        </div>

      
      )

    
};

